app/views/itineraries/new.html.erb

SELECT "users".* FROM "users"
---
<%= f.label :user_id%>
<%= f.collection_select :user_id, User.all, :id, :name %><br>