app/views/itineraries/show.html.erb

SELECT "entries".* FROM "entries" WHERE "entries"."itinerary_id" = ? ORDER BY "entries"."date" ASC  [["itinerary_id", 2]]
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% if @itinerary.archived == false %>
<% entries = @itinerary.entries.order(:date)%>
<% destinations = []%>
<% entries.each { |entry| destinations << entry.event.destination} %>

SELECT "entries".* FROM "entries" WHERE "entries"."itinerary_id" = ? ORDER BY "entries"."date" ASC  [["itinerary_id", 3]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  <h2><%= link_to d.name, destination_path(d)%></h2>
  <% @itinerary.entries.order(:date).each do |entry|%>
    <% if Event.find(entry.event_id).destination_id == d.id%>

SELECT "entries".* FROM "entries" WHERE "entries"."itinerary_id" = ? ORDER BY "entries"."date" ASC  [["itinerary_id", 3]]
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
<% else %>
<% entries = @itinerary.entries.order(:date)%>
<% destinations = []%>
<% entries.each { |entry| destinations << entry.event.destination} %>

SELECT "entries".* FROM "entries" WHERE "entries"."itinerary_id" = ? ORDER BY "entries"."date" ASC  [["itinerary_id", 3]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  <%= d.name%>
  <% @itinerary.entries.order(:date).each do |entry|%>
    <% if Event.find(entry.event_id).destination_id == d.id%>