app/views/entries/new.html.erb

SELECT "destinations".* FROM "destinations"
SELECT "itineraries".* FROM "itineraries"
---
<%= f.label :destination_id%>
<%= f.collection_select :destination_id, Destination.all, :id, :name %><br>
<%= f.label :itinerary_id%>
<%= f.collection_select :itinerary_id, Itinerary.all, :id, :name %><br>