app/views/event_entries/new.html.erb

<%= f.label :event_id%>
<%= f.collection_select :event_id, Event.all, :id, :name %><br>
<%= f.label :entry_id%>
<%= f.collection_select :entry_id, Entry.all, :id, :itinerary_id %><br>
---
SELECT "events".* FROM "events"
SELECT "entries".* FROM "entries"