app/controllers/destinations_controller.rb

    def index
        @destinations = Destination.all.sort_by &:name
        @countries = Destination.distinct.pluck(:country)
        @states = Destination.distinct.pluck(:state)
        @cities = Destination.distinct.pluck(:city)
---
SELECT DISTINCT "destinations"."city" FROM "destinations"