app/controllers/destinations_controller.rb

    def index
        @user = User.find(session[:id])
        @countries = Destination.all.map {|d| d.country}.uniq
        @states = Destination.all.map {|d| d.state}.uniq
        if !params[:state].blank? && !params[:city].blank?
            flash[:alert] = "Choose 1 category to filter at a time"
            @destinations = Destination.all
            redirect_to destinations_path

        elsif !params[:state].blank?
            @destinations = Destination.find_by_state(params[:state])
        elsif !params[:city].blank?
            @destinations = Destination.find_by_city(params[:city])
        elsif params[:category] == "Popularity"
            @destinations = Destination.most_popular_destinations
        elsif params[:category] == "Rating high to low" && !params[:limit].blank?
            @a_destinations = Destination.highest_to_lowest_rating_destinations.first(params[:limit].to_i)
        elsif params[:category] == "Rating high to low"
            @a_destinations = Destination.highest_to_lowest_rating_destinations
        elsif params[:category] == "Rating low to high" && !params[:limit].blank?
            @a_destinations = Destination.lowest_to_highest_rating_destinations.first(params[:limit].to_i)
        elsif params[:category] == "Rating low to high"
            @a_destinations = Destination.lowest_to_highest_rating_destinations
        elsif params[:limit]
            @destinations = Destination.all.first(params[:limit].to_i)
        else
            @destinations = Destination.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT DISTINCT "destinations"."country" FROM "destinations"
SELECT DISTINCT "destinations"."state" FROM "destinations"
SELECT "destinations".* FROM "destinations" WHERE "destinations"."city" = ?  [["city", "Fort Davis"]]
SELECT "destinations".* FROM "destinations"
SELECT "destinations".* FROM "destinations" ORDER BY "destinations"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def show
        @destination = Destination.find(params[:id])
        @itineraries = User.find(session[:id]).itineraries.where('archived = false')
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]