app/controllers/destinations_controller.rb

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @destination = Destination.find(params[:id])