app/controllers/entries_controller.rb

SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def new
        @entry = Entry.new
        @itineraries = User.find(session[:id]).itineraries

INSERT INTO "entries" ("event_id", "date", "itinerary_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["event_id", 2], ["date", "2021-01-08 00:00:00"], ["itinerary_id", 2], ["created_at", "2021-01-05 17:26:46.319280"], ["updated_at", "2021-01-05 17:26:46.319280"]]
---
    def create
        @entry = Entry.new(entry_params)
        if @entry.save

SELECT "destinations".* FROM "destinations" INNER JOIN "events" ON "destinations"."id" = "events"."destination_id" WHERE "events"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE (visited = true)
---
    def most_popular_destination
        hash = Hash.new(0)
        Entry.where('visited = true').map {|entry| entry.destination}.each {|d| hash[d]+=1}

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "entries" SET "visited" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["visited", 1], ["updated_at", "2021-01-06 15:15:31.561896"], ["id", 13]]
---
    def update
        @entry = Entry.find(params[:id])
        @entry.update(visited: true)