app/controllers/favorites_controller.rb

    def index
        if params[:user_id]
            if User.find_by(id: params[:user_id]).nil?
                redirect_to User.find(session[:id])
            else
                @favorites = User.find(session[:id]).favorites
            end
        else
             @favorites = User.find(session[:id]).favorites
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 1]]

    def create
        # byebug
        @favorite = Favorite.create(favorite_params)
---
INSERT INTO "favorites" ("user_id", "destination_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["destination_id", 4], ["created_at", "2021-01-05 22:33:16.214754"], ["updated_at", "2021-01-05 22:33:16.214754"]]