app/controllers/itineraries_controller.rb

    def index
        if params[:user_id]
            if User.find_by(id: params[:user_id]).nil?
                redirect_to User.find(session[:id])
            else
                # byebug
                @itineraries = User.find(session[:id]).itineraries.where('archived = false')
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def show
        # @user_event = UserEvent.new
        @user = User.find(session[:id])
        if params[:user_id]
            if Itinerary.find_by(id: params[:id], user_id: params[:user_id]).nil?
                flash[:alert] = ["Itinerary not found"]
                redirect_to user_itinerarys_path(User.find(params[:user_id]))
            else
                @itinerary = Itinerary.find_by(id: params[:id], user_id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = ? AND "itineraries"."user_id" = ? LIMIT ?  [["id", 4], ["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
        @itinerary = Itinerary.new(itinerary_params)
        if @itinerary.save
---
INSERT INTO "itineraries" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Raul's Birthday Vacation"], ["user_id", 1], ["created_at", "2021-01-05 16:51:44.458482"], ["updated_at", "2021-01-05 16:51:44.458482"]]

    def update
        @itinerary = Itinerary.find(params[:id])
        @itinerary.update(archived: true)
---
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "itineraries" SET "archived" = ?, "updated_at" = ? WHERE "itineraries"."id" = ?  [["archived", 1], ["updated_at", "2021-01-07 15:14:55.566565"], ["id", 3]]

    def archived
        if params[:user_id]
            if User.find_by(id: params[:user_id]).nil?
                redirect_to User.find(session[:id])
            else
                @itineraries = User.find(session[:id]).itineraries.where('archived = true')
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."user_id" = ? AND (archived = true)  [["user_id", 1]]