app/models/destination.rb

    def self.most_popular_destinations
        hash = Hash.new(0)
        Entry.where('visited = true').map {|entry| entry.destination}.each {|d| hash[d]+=1}
---
SELECT "destinations".* FROM "destinations" INNER JOIN "events" ON "destinations"."id" = "events"."destination_id" WHERE "events"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE (visited = true)