app/views/destinations/show.html.erb

<hr/>
<% if !User.find(session[:id]).favorites.any? {|favorite| favorite.destination == @destination }%>
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]


<% @destination.events.each do |event|%>
  <li><%= link_to event.name, destination_event_path(@destination,event)%> - Price: <%= event.price%></li>
  <% if User.find(session[:id]).itineraries.length > 0%>
---
SELECT "events".* FROM "events" WHERE "events"."destination_id" = ?  [["destination_id", 4]]
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

<h3>All Reviews</h3>
<% @destination.reviews.order('id DESC').each do | review | %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."destination_id" = ? ORDER BY id DESC  [["destination_id", 4]]